<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Documento sin t&iacute;tulo</title>
<style type="text/css">
<!--
.Estilo1 {color: #00FF00}
body {
	background-color: #000000;
}
-->
</style>
</head>

<body>
<div align="justify">
  <p class="Estilo1">La sintaxis del lenguaje ensamblador es el conjunto de reglas que determinan c&oacute;mo se escriben y se interpretan las instrucciones, los datos, las etiquetas y las directivas en un programa de ensamblador. La sintaxis puede variar seg&uacute;n el tipo de ensamblador y la arquitectura del procesador que se utilice. En general, la sintaxis del lenguaje ensamblador tiene la siguiente forma:</p>
  <div align="right" class="Estilo1">
    <div align="center">
      <pre>[etiqueta:] mnem&oacute;nico [operando1, operando2, ...] [;comentario]</pre>
    </div>
  </div>
  <p class="Estilo1">Donde:</p>
  <p class="Estilo1">etiqueta es un nombre opcional que identifica una posici&oacute;n  de memoria o una constante.<br />
  mnem&oacute;nico es el nombre simb&oacute;lico de una instrucci&oacute;n o una  directiva del ensamblador.<br />
  operando es un registro, una constante, una direcci&oacute;n de  memoria o una expresi&oacute;n que especifica el valor o la ubicaci&oacute;n de los datos que  se manipulan con la instrucci&oacute;n.<br />
  ;comentario es un texto opcional que explica el prop&oacute;sito o  el funcionamiento de la instrucci&oacute;n.<br />
  Por ejemplo, la siguiente l&iacute;nea de c&oacute;digo en lenguaje  ensamblador para la arquitectura x86 copia el valor de la direcci&oacute;n de memoria  1000 al registro AL:</p>
  <div align="center">
    <pre class="Estilo1">MOV AL, [1000] ;copia el valor de la memoria 1000 a AL</pre>
  </div>
  <div align="justify">
    <p class="Estilo1">Un compilador de assembler es espec&iacute;fico para cada  arquitectura de procesador, y suele ofrecer opciones para optimizar el c&oacute;digo  generado, depurar errores y generar archivos ejecutables o de objeto. Algunos  ejemplos de compiladores de assembler son:</p>
    <p class="Estilo1"><br />
      Online Assembler (NASM) Compiler: Es un compilador de  assembler online que usa el ensamblador NASM, uno de los m&aacute;s populares para la  arquitectura x86. Permite escribir, compilar y ejecutar c&oacute;digo assembler desde  el navegador, sin necesidad de instalar ning&uacute;n software.<br />
      Turbo Assembler: Es uno de los ensambladores m&aacute;s conocidos,  creado por Borland para la plataforma IBM. Tiene una sintaxis similar al  ensamblador MASM, pero ofrece m&aacute;s caracter&iacute;sticas y facilidades para el  programador. Es compatible con los modos de 16 y 32 bits, y puede generar  archivos ejecutables o de objeto.<br />
      GNU Assembler<br />
      GNU Assembler: Es el ensamblador del proyecto GNU, usado  para el sistema operativo Linux. Soporta m&uacute;ltiples arquitecturas de procesador,  como x86, ARM, MIPS, PowerPC, entre otras. Forma parte de la colecci&oacute;n de  herramientas GNU Binutils, que incluye otros programas &uacute;tiles para el  desarrollo de software en bajo nivel.<br />
      Flat assembler<br />
      Flat Assembler: Es un ensamblador libre usado para  procesadores x86. Tiene una sintaxis simple y consistente, y puede generar  archivos ejecutables o de objeto para varios formatos, como DOS, Windows,  Linux, entre otros. Es muy r&aacute;pido y ocupa poco espacio en disco</p>
  </div><p>&nbsp;</p>
</div>
</body>
</html>
